app/controllers/shares_controller.rb

  def index
    @shares = Share.all
---
SELECT "shares".* FROM "shares"

  def destroy
    @share.destroy
---
DELETE FROM "shares" WHERE "shares"."id" = ?  [["id", 1]]

    def set_share
      @share = Share.find(params[:id])
---
SELECT "shares".* FROM "shares" WHERE "shares"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]